In [30]:
import numpy
import pandas as pd

train_x = pd.read_csv('train.csv')
test_x = pd.read_csv('test.csv')

train_x.head()
test_x.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [31]:
train_x.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [32]:
train_x=train_x[['Survived','Pclass','Sex','Fare']]

train_x.head()

   Survived  Pclass     Sex     Fare
0         0       3    male   7.2500
1         1       1  female  71.2833
2         1       3  female   7.9250
3         1       1  female  53.1000
4         0       3    male   8.0500

In [33]:
# null 값 모두 제거 

train_x.dropna(inplace=True)

In [34]:
import numpy as np

In [35]:
_, train_x['Sex'] = np.unique(train_x['Sex'], return_inverse=True)

In [36]:
train_y = np.ravel(train_x.Survived)
train_x.drop(['Survived'], inplace =True, axis=1)
train_x

     Pclass  Sex     Fare
0         3    1   7.2500
1         1    0  71.2833
2         3    0   7.9250
3         1    0  53.1000
4         3    1   8.0500
..      ...  ...      ...
886       2    1  13.0000
887       1    0  30.0000
888       3    0  23.4500
889       1    1  30.0000
890       3    1   7.7500

[891 rows x 3 columns]

In [37]:
from keras.models import Sequential
from keras.layers import Dense

model = Sequential()

model.add(Dense(16, activation='relu', input_shape=(3,)))
model.add(Dense(8, activation='relu'))
model.add(Dense(1, activation='sigmoid'))

Using Theano backend.

In [10]:
df.isnull().sum() #null값 없음

Survived    0
Pclass      0
Sex         0
Fare        0
dtype: int64

In [12]:
import numpy as np

In [15]:
_, df['Sex'] = np.unique(df['Sex'], return_inverse=True)

In [19]:
df['Sex']

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: Sex, Length: 891, dtype: int64

In [20]:
train_y = np.ravel(df.Survived) # Make 1D
train_x = df.drop(['Survived'], inplace=True, axis=1)

In [26]:
df

     Pclass  Sex     Fare
0         3    1   7.2500
1         1    0  71.2833
2         3    0   7.9250
3         1    0  53.1000
4         3    1   8.0500
..      ...  ...      ...
886       2    1  13.0000
887       1    0  30.0000
888       3    0  23.4500
889       1    1  30.0000
890       3    1   7.7500

[891 rows x 3 columns]

(2673,)

In [23]:
print(train_x)

None

In [74]:
from sklearn.preprocessing import LabelEncoder
encoder_gender = LabelEncoder()
df['Sex']=encoder_gender.fit_transform(df['Sex'].values)
df.head()

   Survived    Pclass  Sex      Fare
0         0  0.827377    1 -0.502445
1         1 -1.566107    0  0.786845
2         1  0.827377    0 -0.488854
3         1 -1.566107    0  0.420730
4         0  0.827377    1 -0.486337

In [75]:
from sklearn.preprocessing import StandardScaler
standard = StandardScaler()
df_std = pd.DataFrame(standard.fit_transform(df[['Pclass','Fare']]),
                     columns=['Pclass','Fare'])

df['Pclass'] = df_std['Pclass']
df['Fare']= df_std['Fare']
df.head()

   Survived    Pclass  Sex      Fare
0         0  0.827377    1 -0.502445
1         1 -1.566107    0  0.786845
2         1  0.827377    0 -0.488854
3         1 -1.566107    0  0.420730
4         0  0.827377    1 -0.486337

In [76]:
#훈련데이터, 정답 데이터 분리 

x = df.drop(columns='Survived')
y = df[['Survived']]

In [77]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x,y, test_size=0.2,
                                                        random_state=1,
                                                        shuffle=True)

y_train.shape # 정답레이블 개수가 712개.

(712, 1)

In [78]:
import numpy as np

In [79]:
y_train= np.ravel(y_train) # ravel : reshape 과 반대방향으로 행렬을 바꿔줌. 
y_test = np.ravel(y_test)

In [80]:
y_train.shape

(712,)

In [81]:
x_train.shape

(712, 3)

In [82]:
from sklearn.svm import LinearSVC
model = LinearSVC(random_state=1)

In [83]:
model.fit(x_train, y_train)
score = model.score(x_test, y_test)
score

C:\Users\LGPC\Anaconda3\envs\keras\lib\site-packages\sklearn\svm\_base.py:947: ConvergenceWarning: Liblinear failed to converge, increase the number of iterations.
  "the number of iterations.", ConvergenceWarning)

0.776536312849162